
      /IF NOT DEFINED(RPGTYPEDEF_CONST)
      /DEFINE RPGTYPEDEF_CONST

         dcl-c MAX_SRCFILE_LEN 240;
         dcl-c MAX_SRCLINE_LEN 228;
         dcl-c MAX_WORKSRC_LEN 4096;

      /ENDIF